Revit 2025 API
RebarSpliceByRulesError Enumeration
 Class that defines states for splicing a Rebar by rules.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RebarSpliceByRulesError
Public Enumeration RebarSpliceByRulesError
public enum class RebarSpliceByRulesError
type RebarSpliceByRulesError
Members
Member name | Value | Description
Success | 0 |  Splice by rules can be successfully done.
Unknown | 1 |  There is an unexpected error.
InvalidRebar | 2 |  Free Form rebars, or Shape Driven rebars that are Multiplanar, or have a shape that whose definition is RebarShapeDefinitionByArc, or rebars that are part of a group can't be spliced.
TooBigHook | 3 |  The hook lengths exceed the maximum length.
TooSmallRunOut | 4 |  The run-out is below minimum length, or the lap can't be applied to it.
MaximumLengthBiggerThanBarLength | 5 |  The maximum length exceeds the bar length.
TooBigArc | 6 |  The arc segment exceeds the maximum length.
CantSpliceAllTheBarsInSet | 7 |  Some bars in the varying set are not intersected by the resulting splice geometries.
LapLengthBiggerThanMaximumBarLength | 8 |  The lap length is greater than the maximum length.
InvalidCombinationOfMaximumMinimumBarLengthAndLapLength | 9 |  The combination of the maximum bar length, minimum bar length and lap length is invalid.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace